[**Байесовский классификатор**](http://www.machinelearning.ru/wiki/index.php?title=%D0%91%D0%B0%D0%B9%D0%B5%D1%81%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D0%BA%D0%BB%D0%B0%D1%81%D1%81%D0%B8%D1%84%D0%B8%D0%BA%D0%B0%D1%82%D0%BE%D1%80) — широкий класс алгоритмов классификации, основанный на принципе максимума апостериорной вероятности. Для классифицируемого объекта вычисляются функции правдоподобия каждого из классов, по ним вычисляются апостериорные вероятности классов. Объект относится к тому классу, для которого апостериорная вероятность максимальна.

В данном ноутбуке будет использоваться [**наивный байесовский классификатор**](http://www.machinelearning.ru/wiki/index.php?title=%D0%9D%D0%B0%D0%B8%D0%B2%D0%BD%D1%8B%D0%B9_%D0%B1%D0%B0%D0%B9%D0%B5%D1%81%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D0%BA%D0%BB%D0%B0%D1%81%D1%81%D0%B8%D1%84%D0%B8%D0%BA%D0%B0%D1%82%D0%BE%D1%80).

В качестве набора данных используется [Adult](https://archive.ics.uci.edu/ml/datasets/Adult), CSV-файл взят [отсюда](https://www.kaggle.com/uciml/adult-census-income).

In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB
%matplotlib inline

In [2]:
pd.options.display.max_columns = None

In [3]:
data = pd.read_csv('adult.csv')
data.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,?,77053,HS-grad,9,Widowed,?,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,?,186061,Some-college,10,Widowed,?,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K

In [4]:
data.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    0
native.country    0
income            0
dtype: int64

In [5]:
data.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num      int64
marital.status    object
occupation        object
relationship      object
race              object
sex               object
capital.gain       int64
capital.loss       int64
hours.per.week     int64
native.country    object
income            object
dtype: object

In [6]:
for column in data.select_dtypes('object').columns:
    display(data[column].value_counts().to_frame())

                  workclass
Private               22696
Self-emp-not-inc       2541
Local-gov              2093
?                      1836
State-gov              1298
Self-emp-inc           1116
Federal-gov             960
Without-pay              14
Never-worked              7

              education
HS-grad           10501
Some-college       7291
Bachelors          5355
Masters            1723
Assoc-voc          1382
11th               1175
Assoc-acdm         1067
10th                933
7th-8th             646
Prof-school         576
9th                 514
12th                433
Doctorate           413
5th-6th             333
1st-4th             168
Preschool            51

                       marital.status
Married-civ-spouse              14976
Never-married                   10683
Divorced                         4443
Separated                        1025
Widowed                           993
Married-spouse-absent             418
Married-AF-spouse                  23

                   occupation
Prof-specialty           4140
Craft-repair             4099
Exec-managerial          4066
Adm-clerical             3770
Sales                    3650
Other-service            3295
Machine-op-inspct        2002
?                        1843
Transport-moving         1597
Handlers-cleaners        1370
Farming-fishing           994
Tech-support              928
Protective-serv           649
Priv-house-serv           149
Armed-Forces                9

                relationship
Husband                13193
Not-in-family           8305
Own-child               5068
Unmarried               3446
Wife                    1568
Other-relative           981

                     race
White               27816
Black                3124
Asian-Pac-Islander   1039
Amer-Indian-Eskimo    311
Other                 271

          sex
Male    21790
Female  10771

                            native.country
United-States                        29170
Mexico                                 643
?                                      583
Philippines                            198
Germany                                137
Canada                                 121
Puerto-Rico                            114
El-Salvador                            106
India                                  100
Cuba                                    95
England                                 90
Jamaica                                 81
South                                   80
China                                   75
Italy                                   73
Dominican-Republic                      70
Vietnam                                 67
Guatemala                               64
Japan                                   62
Poland                                  60
Columbia                                59
Taiwan                                  51
Haiti                                   44
Iran                                    43
Portugal                                37
Nicaragua                               34
Peru                                    31
France                                  29
Greece                                  29
Ecuador                                 28
Ireland                                 24
Hong                                    20
Trinadad&Tobago                         19
Cambodia                                19
Thailand                                18
Laos                                    18
Yugoslavia                              16
Outlying-US(Guam-USVI-etc)              14
Hungary                                 13
Honduras                                13
Scotland                                12
Holand-Netherlands                       1

       income
<=50K   24720
>50K     7841

Выше можно увидеть, что в некоторых переменных - `workclass`, `occupation`, `native.country` - встречается `?`. Это обозначение пропущенных данных.

Выполним замену `?` на `NaN` и заполним пропуски модой.

In [7]:
data[data == '?'] = np.nan

/home/mgolikov/.local/lib/python3.6/site-packages/pandas/core/ops/__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

In [8]:
data.isna().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [9]:
for column in ['workclass', 'occupation', 'native.country']:
    data[column].fillna(data[column].mode()[0], inplace=True)

In [10]:
data

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,90,Private,77053,HS-grad,9,Widowed,Prof-specialty,Not-in-family,White,Female,0,4356,40,United-States,<=50K
1,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
2,66,Private,186061,Some-college,10,Widowed,Prof-specialty,Unmarried,Black,Female,0,4356,40,United-States,<=50K
3,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
4,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,22,Private,310152,Some-college,10,Never-married,Protective-serv,Not-in-family,White,Male,0,0,40,United-States,<=50K
32557,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32558,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32559,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32560,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K

In [13]:
X = data.drop(columns='income')
y = data['income']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=0)

In [16]:
gnb = GaussianNB()
y_pred = gnb.fit(X_train, y_train).predict(X_test)
print("Number of mislabeled points out of a total %d points : %d" % (X_test.shape[0], (y_test != y_pred).sum()))

ValueError: could not convert string to float: 'State-gov'